package com.xyh.dtb.singleton

import com.xyh.dtb.pojo.entity.RandomMoviesData

object MovieSampleList { // 示例电影数据
    val movieList = listOf(
        RandomMoviesData(
            2298197,
            "黑帮四贱客 4발가락",
            7.0,
            "https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2212627487.webp",
            "AUDI、LeCaf、角Grandeur和Haitai四人在高中时期是光州出名的四人帮“4Toes”的成员。他们在那时开始成为好友，各人更为其他成员伸张正义。高考过后，LeCaf因为成绩优异，考入了汉城的大学，而“4Toes”剩下的三名成员却考不上大学。三人在光州的日子实在不太好过，于是他们决定一起到汉城，令“4Toes”再次结合。可是，他们在汉城的日子，却比在光州时更难过。他们开始怀缅以往的日子，虽然他们已不再是学生，但他们仍回味像以往般强出头来……"
        ),
        RandomMoviesData(
            24748605,
            "小鸟游六花·改 剧场版 中二病也要谈恋爱！ 小鳥遊六花・改 ～劇場版 中二病でも恋がしたい！～",
            6.6,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2006281563.webp",
            "寒冷的冬夜，窝在社团暖炉里睡觉的小鸟游六花（内田真礼 配音）做了一个奇怪的梦，梦中她和富樫勇太（福山润 配音）如愿走入婚礼殿堂，可就在关键时刻，作为随从的凸守早苗（上坂堇 配音）突然闯入要带走主人。激烈的魔法大战，六花和勇太也面临着生离死别。醒来之后，早苗走入房间，和五月七日茴香（浅仓幸美 配音）一起询问了六花与勇太“命运重逢”的经过。一切始于那个迷离浪漫的邂逅之夜，前中二病少年勇太并没有如愿得到期待已久的正常高中生活，反而遇到了中毒中二病患者六花，他们的命运彼此交错，连带茴香、早苗、一色等朋友以及他们的家人，快乐美好的回忆交替浮现眼前……本片为同名动画的剧场总集版。"
        ),
        RandomMoviesData(
            4935209,
            "龙虎斗 The Brothers Rico",
            6.8,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p1086542120.webp",
            "一位黑帮的会计师一天突然被帮会组织要求找出他兄弟的下落，他该何去何从。。。"
        ),
        RandomMoviesData(
            1304209,
            "冒名顶替 Impostor",
            6.8,
            "https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2164407769.webp",
            "21世纪第一个50年，人类没有迎来最终的繁荣与和平，反而陷入旷日持久的星际战争中。地外文明辛塔利入侵地球，无数人类的勇士前仆后继，战死沙场。时间来到2079年。为了最终摧毁外星入侵者，人类加紧对新式武器的开发。斯宾赛·奥哈蒙（加里·希尼斯 Gary Sinise 饰）是武器研发部门的工程师，他的研究取得突破，新式武器的诞生指日可待。而就在这关键时刻，斯宾塞的身份遭到质疑。政府怀疑他是辛塔利派来的间谍，其体内更藏有一颗威力强大的炸弹。他虽然不断辩解，但无济于事。眼看命悬一线，斯宾塞伺机逃亡。他一面躲避政府的追捕，一面要想方设法证明自己的清白。在这一过程中真相逐渐浮出水面，面对真相，斯宾塞本人也受到莫大震动……"
        ),
        RandomMoviesData(
            1303740,
            "信徒 The Believer",
            8.0,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p1963785443.webp",
            "居住在纽约的犹太青年丹尼•贝林特（Ryan Gosling 雷恩•高斯林 饰）曾是希伯来语学校的高材生，但在学习过程中他不断对《旧约》以及本民族的信仰产生质疑。他的疑问令校方不知所措，最终将其开除了之。丹尼自此对犹太同胞由爱生恨，他开始有意识地接触新纳粹团体，并最终成为3K党中的一员……影片根据真实事件改编，男主角原型Dan Burros先后参加美国新纳粹和3K党，在记者揭露其犹太身份后，Dan自杀身亡。本片荣获2001年圣丹斯电影节评审团大奖、2001年俄罗斯影评人协会最佳外语片男主角（Ryan Gosling）。"
        ),
        RandomMoviesData(
            2049705,
            "梦比优斯奥特曼和奥特兄弟 ウルトラマンメビウス&ウルトラ兄弟",
            8.4,
            "https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2168899397.webp",
            "奥特兄弟：奥特曼、赛文、杰克、艾斯，为了阻止亚波人怨气的集合体最终超兽萨乌鲁斯攻击地球、也为了避免在宇宙空间展开激烈的战争，奥特兄弟与强大的合体兽进行了一番苦战。但隐约感觉到神户将会沉没的奥特兄弟，使用了\"最终十字屏障\"，封印了这股邪恶力量。可是，使用\"最终十字屏障\"需要使用大量的光能，这就意味着奥特曼失去了变身的能力。于是，时光流逝到了现在。在地球上，诞生了一位继承了奥特兄弟意志的新英雄，他的名字就是梦比优斯奥特曼。"
        ),
        RandomMoviesData(
            2969480,
            "冬天的猴子 Un singe en hiver",
            8.1,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2513144970.webp",
            "暂无简介"
        ),
        RandomMoviesData(
            3040471,
            "百分百感觉之人小鬼大 人細鬼大之三個Handsup的少年",
            6.1,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p1519747233.webp",
            "Janson在沙滩上回忆他十年前的一段初恋.这一年,一个清纯漂亮的女生竟然来到他们的课室做插班生,她叫琪琪.第一天上学,琪琪便主动跟Janson表现得非常亲匿,原来她只是想借他来刺激其男友,还以为琪琪对他有好感,直至有一晚,琪琪却突然失踪......以八十年代香港为背景的校园爱情喜剧，三个男主角是以《古惑仔》系列开始令人留下印象的朱永棠、谢天华和林海峰，饰演活泼调皮的中学生。在谭咏麟与张国荣在香港歌坛争持得激烈的那一年，他们班上来了一位美丽性感的插班生舒淇。她在上课的第一天便对朱永棠主动表示亲热，令他神魂颠倒，乃与两名好友合作展开追求攻势，不料舒淇此举的目的只是为了刺激其男朋友陈小春，而她的真正身份竟是别人的情妇。"
        ),
        RandomMoviesData(
            1307644,
            "鬼屋 The Haunted Mansion",
            6.1,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2198716195.webp",
            "吉姆·埃佛斯（艾迪·墨菲 Eddie Murphy 饰）是一名巧舌如簧、口才一流的房地产商人。凭借出色的经营手段，他和妻子儿女过着安逸自在的生活。这一天，吉姆迎来了和老婆莎拉（玛莎·托马森 Marsha Thomason 饰）的结婚纪念日。当晚，吉姆收到一通卖方电话。那是一幢价值不菲的豪宅，他见钱眼看，临时改变了和家人的度假计划，先取道前往这幢位于荒郊野外且拥有上百年历史的宅邸。这里阴森恐怖，荒凉诡异。而接待他们的老管家兰斯利（Terence Stamp 饰）和男主人格雷斯（Nathaniel Parker 饰）更为古怪。暴风雨阻断了埃佛斯家的行程，他们被迫留在格雷斯庄园，却发现这里竟是一幢鬼魂出没的恐怖鬼屋……本片荣获2004年青年艺术家奖最佳青年女配角奖（Aree Davis）。"
        ),
        RandomMoviesData(
            1305416,
            "傻大姐翻转疯人院",
            5.9,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2227968326.webp",
            "新闻报道员清（毛舜筠）在一次采访中认识了导游华（吴君如），二人因工作结下梁子。清的丈夫周民生是精神科医生，在一次意外中离奇失踪。不久清知道原来华为民生的另一个妻子，二人原来一直不知道对方的存在。华与清不约而同装疯扮傻，要混进民生所工作的精神病院调查他的秘密。长时间相处，二人敌意渐渐消除，开始合作。不久她们发现民生可能另有第三个女人，遂决定要找出这女人的真正身份。在调查过程中，清和华察觉原来本身并不了解民生，便想放弃追查，二人出院当天，民生突然出现，要求跟她们复合，惟二人心灰意冷，决定离开他……"
        ),
        RandomMoviesData(
            1302142,
            "地球末日 Asteroid",
            4.7,
            "https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2334075548.webp",
            "暂无简介"
        ),
        RandomMoviesData(
            24869803,
            "金橘 Mandariinid",
            8.4,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2167417884.webp",
            "1990年的阿布哈兹战争期间，爱沙尼亚人伊福被迫留下了收获金橘，流血冲突打到了他家门口，一个受伤的男人留了下来，伊福被迫之下收留了他。"
        ),
        RandomMoviesData(
            27107141,
            "雪耻女孩 リベンジgirl",
            5.3,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2506120575.webp",
            "宝石美辉（桐谷美玲 饰）是东大最受欢迎的校花第一名。但遗憾的是，她的性格极差且不自知。在她经历了一次惨痛的失恋之后，她发誓要进行一次赌上人生的“复仇”。那就是成为日本首位女首相。由此，美辉开始了她的恋爱复仇计划。"
        ),
        RandomMoviesData(
            1395091,
            "未麻的部屋 Perfect Blue",
            8.9,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p1351050722.webp",
            "当红三人少女偶像团体Charming Bird面临解散，核心成员雾越未麻在事务所的安排下不得不退出团体，转型成为一名电视剧演员。万事开头难，对于偶像歌手转型而来的未麻尤其如此，她在工作中承受着压力，闷闷不乐。与此同时，各种恐吓信不断、经纪人田所先生遇袭以及以自己的口吻在网站上写日记的神秘人都让未麻焦虑不已，恍惚间她甚至看到另一个自己。未麻的苦恼无人知晓，贪婪的田所甚至同意剧组的剧本，要求未麻出演一场尺度极大的强暴戏。这次演出成为未麻演艺事业的转折点，她的出镜率开始攀升，甚至还拍摄了裸露的写真。与此相对，电视剧编剧涩谷和曾给未麻拍下裸照摄影师村野接连遇害。未麻的生活变得混乱不堪，真相究竟如何？本片荣获1997年亚洲奇幻电影节最佳亚洲影片。"
        ),
        RandomMoviesData(
            26575145,
            "坚强 Stronger",
            6.6,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2493377993.webp",
            "故事改编自杰夫·伯曼的同名纪实回忆录，讲述当年他在终点等待参赛的女友时，不幸遭遇炸弹袭击，失去双腿，并重新生活的个人经历。"
        ),
        RandomMoviesData(
            1464602,
            "东瀛游侠",
            6.2,
            "https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2429990997.webp",
            "故事发生在福建海口镇，林同善（于海 饰）和陈亚珍均生长于武术之家，两家人的关系因此十分淡漠。某日，侵华倭寇绑架了陈亚珍的孩子小毛头，此事恰巧被一位名叫上地完雄（于荣光 饰）的年轻武士撞见，上地完雄来中国，希望能够在这里磨炼技艺，正义感爆棚的他救下了小毛头，却在一场意外中含冤背负了杀人的罪名，只有小毛头一人知晓上地完雄的清白。在南少林寺尚智大师的调解之下，林、陈两家放下恩怨，冰释前嫌。此时正值妈祖节，街道上涌动着游行欢庆的队列。在一片欢乐祥和的气氛下，日本人川岛和矢村正在酝酿着他们的阴谋，他们妄图盗取妈祖像上价值连城的夜明珠。"
        ),
        RandomMoviesData(
            1439085,
            "真爱如心 Herz im Kopf",
            6.5,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2259065256.webp",
            "一个18 岁的男孩Jakob回到法兰克福，一年前他因为母亲死亡而离开。当他设法正常地生活时，他认识了当保姆的波兰女子Wanda, 并且爱上她。但是大家都有些不满意对方。"
        ),
        RandomMoviesData(
            3067214,
            "下坡路 Downhill",
            6.3,
            "https://img1.doubanio.com/view/photo/s_ratio_poster/public/p2201557259.webp",
            "大学运动队长罗迪•贝维克（艾弗•诺维诺饰）因为勾引一名女招待并与他生下孩子而受到指责，但他拒绝说出真正的肇事者，他的好友蒂姆•韦克利（罗宾•欧文饰）。他因此被赶出了学校，并且因为不满父亲贝维克爵士（诺曼•麦金尼尔饰）怀疑他的清白而离家出走。他加入了一支歌舞剧团，爱上了一个贪慕虚荣的女演员茱莉亚（伊莎贝尔•琼斯），不久他继承了三万英镑的遗产。他买下豪宅并供养茱莉亚挥霍，茱莉亚却勾搭上了另外一个男演员阿奇（伊恩•亨特）。最终，罗迪失去了财产和茱莉亚。他一贫如洗，来到了巴黎当起陪舞，最终流落到马赛的廉价旅店。旅店老板收留他的原因是想把他送回家后另一笔酬金。罗迪发现自己身处货轮，那些被人伤害、欺骗的回忆一一在他眼中闪现，人生的这段下坡路不断刺激着他。最后几经漂泊终于回到了家中，等待他的是……希区柯克曾说其中一个镜头呈现“颠倒站立的诺维洛”是他所有电影中个非..."
        ),
        RandomMoviesData(
            1939903,
            "欢迎回家，罗斯科·杰金斯 Welcome Home, Roscoe Jenkins",
            6.2,
            "https://img3.doubanio.com/view/photo/s_ratio_poster/public/p2386476783.webp",
            "史蒂文斯（马丁·劳伦斯 Martin Lawrence 饰）是目前大众视野中最当红的脱口秀明星，他的成功学演讲激励了无数深陷泥潭的年轻人们，引导着他们重新找回了人生的方向。实际上，史蒂文斯拥有着卑微的过去，在他的故乡，一座名为“旱泉”的小镇里，年幼的史蒂文斯，是邻里乡亲们嘲笑和欺负的对象。史蒂文斯决定返乡参加父母的五十周年结婚纪念日，其主要目的是要让守在家乡故步自封的乡亲们见识见识，自己再也不是过去那个什么也不是的穷小子了。然而，现实是残酷而又令人尴尬的，无论史蒂文斯走得多远，爬得多高，只要一回到家乡，他依然什么都不是。但与此同时，史蒂文斯却又感受到了浓浓的故乡之情。"
        ),
        RandomMoviesData(
            2294271,
            "恋爱之道",
            7.0,
            "https://img1.doubanio.com/view/photo/s_ratio_poster/public/p1490565808.webp",
            "周家浩和錢蘭英獲悉女兒元珍訂婚的消息, 勾起夫婦二人追憶往事, 細說戀愛之道. 二十年前, 家浩因要參加北伐而離開蘭英, 因部隊遷移, 雙方失去聯絡. 蘭英在闊少爺張鴻昌竭力追求和母親的催促下, 答應了婚事. 家浩後來回到上海找蘭英, 蘭英決定悔婚, 和家浩私奔. 二人結成夫婦, 並南下廣州建立家庭, 誕下元珍. 孩子出生後, 蘭英與母親逐漸冰釋前嫌, 一家三口遂遷回上海. 家浩在紗廠當小職員, 生活安穩, 誰知鴻昌正是紗廠老闆, 家浩憤而辭職. 戰事日緊, 家浩一家跟隨民眾撤向大西南, 且在黔桂鐵路的小站當上副站長. 鴻昌攜同妻子, 帶着大批私貨逃難經過, 欲佔貨卡載貨, 惟家浩秉正不阿, 堅決不從. 不巧元珍此時患上肺炎, 急需特效藥救治, 鴻昌竟以藥要脅, 幸好難民之中有人相贈藥物. 鴻昌不擇手段, 強奪火車離去. 抗戰勝利, 家浩一家雖然清貧..."
        )
    )
}